//ypoergasia3_1A(2) 

#include<stdio.h>


main()
{
    
    int x=1, y = 3;
    printf("%d %d\n",x,y);
    what(&x,&y);//βημα 1
    printf("%d %d\n",x,y);

}
void what(int*a,int*b)/*οι μεταβλητες a,b ειναι δεικτες που δειχνουν ακεραιους στις
                       διευθυνσεις θεσεων μνημης που ειναι αποθηκευμενες οιμεταβλητες 
                       x&y οπως φαινονται στο βημα 1*/
                       
                      
{
    *a=*a+1;//θα τυπωσει χ=2 δηλαδη την τιμη του χ αυξημενη κατα 1 
    *b=++*b;/*θα τυπωσει y=4 γιατι το b αφου ειναι δεικτης στη διευθυνση θεσης μνημης της μεταβλητης y
	        θα αυξησει πρωτα την τιμη του σε y=4 και μετα η printf θα τυπωσει το αποτελεσμα.*/
  
    
}
